1:WizQuizTestQuestions
00000000

Who is Bill Tanner's sister?
00000001

Sarah Tanner
00000002

Ellen Tanner
00000003

Emily Tanner
00000004

Suzie GryphonBane
00000005

Who is Buikha Djeserit's brother?
00000006

Nounti Djeserit
00000007

Mshai Djeserit
00000008

Sihathor Djeserit
00000009

Yakobaam Ahnic
00000010

How many portal summoning candles are in the Burial Mound?
00000011

Three
00000012

Seven
00000013

Four
00000014

Trick Question - Zero
00000015

What color is the door inside the boys dorm room?
00000016

Red
00000017

Blue
00000018

Green
00000019

Brown
00000020

Kirby Longspear was once a student of which school of magic?
00000021

Death
00000022

Life
00000023

Balance
00000024

Myth
00000025

Mr Rowley's Gold Watch is a verifiable antique from what world?
00000026

Celestia
00000027

Marleybone
00000028

Wysteria
00000029

Weirwood
00000030

What shape is on the weather vanes in the Shopping District?
00000031

Half Moon / Moon
00000032

Sun
00000033

Star
00000034

Spiral
00000035

What are "Today's Lessons" in the School of Balance building?
00000036

No one knows, they're in hieroglyphics
00000037

Nothing
00000038

Welcome to balance
00000039

Balance is all
00000040

What are "Today's Lessons" in the School of Fire building?
00000041

Cast a fire sword & cast a fire elf
00000042

Cast a fire elf & cast a fire snake
00000043

Cast a fire cat & cast a fire sword
00000044

Cast a fire bat & cast a fire cat
00000045

What are "Today's Lessons" in the School of Ice building?
00000046

Blue snow flakes & create stairs of ice
00000047

Icicle wands and avalanches
00000048

Snow drifts and flurries
00000049

Igloos building and freezing rain
00000050

What are "Today's Lessons" in the School of Life building?
00000051

Cast a bounceback & cast a seraph
00000052

Cast a pixie & heal a friend
00000053

Summon a pixie & heal a friend
00000054

Heal a friend & cast a bounceback
00000055

What are "Today's Lessons" in the School of Myth building?
00000056

Cast a cyclops & cast a troll
00000057

Summon a minion & cast a troll
00000058

Cast a cyclops & cast a blood bat
00000059

Cast a bloodbat & summon a minion
00000060

What are "Today's Lessons" in the School of Storm building?
00000061

Cast a thundersnake & cast a lightning bolt
00000062

Cast a thundersnake & cast a storm bat
00000063

Cast a storm bat & cast a windstorm
00000064

Cast a storm shark & cast a kraken
00000065

What are the school colors of Balance?
00000066

Tan and Maroon
00000067

Gold and Yellow
00000068

Red and Silver
00000069

Maroon and white
00000070

What badge do you receive when you defeat Lord Nightshade?
00000071

Wizard City Protector
00000072

Nightstalker
00000073

Three Streets Savior
00000074

Hero of Unicorn Way
00000075

What book was Anna Flameright accused of stealing?
00000076

Advanced Flameology
00000077

History of Fire Magic
00000078

Time of the Dragons
00000079

Tome of the Sun
00000080

What book does Dworgyn require?
00000081

The Dark Grimoire
00000082

War of the Clans
00000083

History of Death Magic
00000084

The Warden
00000085

What book does Professor Drake send you to the library to check out?
00000086

Book on the Wumpus
00000087

Basic Wizarding & Proper Care of Familiars 
00000088

Advanced Flameology
00000089

History of Death Magic
00000090

What can be used to diminish the Nirini's powers in Krokotopia?
00000091

Flame Gems
00000092

Ice Gems
00000093

Green Gems
00000094

No one knows
00000095

What color is Bartleby's eye?
00000096

Blue 
00000097

Green
00000098

Brown
00000099

Hazel
00000100

What course did Herold Digmoore study?
00000101

Ancient Myths for Parliament
00000102

Alchemy101
00000103

Equilibrium Magic
00000104

Variant Magic
00000105

What did Abigail Doolittle accuse Wadsworth of stealing? 
00000106

Genuine Imitation Golden Ruby
00000107

Genuine Imitation Golden Pearl
00000108

Genuine Imitation Golden Emerald
00000109

Genuine Imitation Golden Diamond
00000110

What did Hetch Al Dim find while looking for his lucky coin?
00000111

A blue gem
00000112

A luckier coin
00000113

His long lost brother
00000114

Bartleby's Eye
00000115

What did the Burly Trolls loot from David Beeman's warehouse?
00000116

MooShu Tea
00000117

Ancient Dates
00000118

Dragon Berries
00000119

Hambrosia
00000120

What did the Gobbler King call Wizard City?
00000121

New Gobblerton
00000122

Candyland
00000123

Weirwood
00000124

Polaris
00000125

What does Cyrus Drake have you fetch from the Myth Tower?
00000126

Cyclops Eye
00000127

Troll Club
00000128

Humungofrog Tongue
00000129

Minotaur Horn
00000130

What does Daren Whisperwind tell you about?
00000131

Boss cheats
00000132

PvP
00000133

Crafting
00000134

Bartleby's eye
00000135

What does every rotting fodder in the dark caves carry with them?
00000136

A spade
00000137

A broom
00000138

A rake
00000139

A towel
00000140

What does Falmea's Bloodstone summon?
00000141

Servants of the Dragon
00000142

Fire Elementals
00000143

Fire Elves
00000144

Draconians
00000145

What does the Sleeper's Timepiece do?
00000146

Bring nightmares to life
00000147

Wake the death sleepers
00000148

Keep time in the Spiral
00000149

Put Wizards to sleep
00000150

What does the Time Ribbon Protect against?
00000151

Time Flux
00000152

Time Travelers
00000153

The Professor
00000154

The Sleeper's Timepiece
00000155

What event is Abigail Doolittle sending out invitations for?
00000156

Policemen's Ball
00000157

Lady Boyle's Party
00000158

Royal Museum's Ball
00000159

Barkingham Palace's Ball
00000160

What initials were on the doctor's glove?
00000161

XX
00000162

MM
00000163

MD
00000164

XM
00000165

What is Ako making with the Frozen Spider Silk?
00000166

Time Ribbon
00000167

Spider Silk Reagents
00000168

Frosted Drakes Cereal
00000169

Blue Silk Kimonos
00000170

What is Diego's full name?
00000171

Diego Santiago Quariquez Ramirez the Third
00000172

Diego Santiago Ramirez Quariquez the Third
00000173

Diego Quariquez Ramirez Santiago the Third
00000174

Diego Ramirez  Santiago Quariquez the Third
00000175

What is Lady Oriel's sister's name?
00000176

Lady Sylvan
00000177

Lady Elizabeth
00000178

Lady Desane
00000179

Lady of the Lake
00000180

What is Mildred Farseer holding in her hands?
00000181

Broom
00000182

Wand
00000183

Book
00000184

Candle
00000185

What is Penny Dreadful allergic to?
00000186

Cyclopses
00000187

Trolls
00000188

Cats
00000189

Dogs
00000190

What is Sgt. Major Talbot's full name?
00000191

Sylvester Quimby Talbot III
00000192

Quimby Talbot III
00000193

Sylvester Talbot III
00000194

Quimby Sylvester Talbot III
00000195

What is Sherlock Bones' address?
00000196

221B Barker Street
00000197

221B Baker Street
00000198

21B Barker Street
00000199

221 Barker Street
00000200

What is the gemstone for Balance?
00000201

Citrine
00000202

Amber
00000203

Carnelian
00000204

Topaz
00000205

What is the name of the school newspaper? Boris Tallstaff knows...
00000206

Ravenwood Bulletin
00000207

Ravenwood Standard
00000208

Ravenwood Examiner
00000209

Ravenwood Sun
00000210

What is the title of the book that is floating around the Wizard City Library? 
00000211

Basic Wizarding & Proper Care of Familiars 
00000212

Book on the Wumpus
00000213

Advanced Flameology
00000214

History of Death Magic
00000215

What item to the Tuts use to charm the Manders?
00000216

Collars of Assent
00000217

Collars of Dissent
00000218

Collars of Obedience
00000219

Collars of Penance
00000220

What job do most of the frogs in Marleybone have?
00000221

Sweeper
00000222

Dancer
00000223

Thug
00000224

Pirate
00000225

What level do you have to be to wear Dragonspyre Crafted Clothing?
00000226

Thirty-three
00000227

Fourty-four
00000228

Thirty
00000229

Thirty-five
00000230

What Queen is mentioned in the book The Golden Age?
00000231

Queen Ellen
00000232

Queen Irisi
00000233

Queen Calypso
00000234

Queen Aryanah
00000235

What school is all about Creativity?
00000236

Storm
00000237

Fire
00000238

Life
00000239

Myth
00000240

What tools does Assistant Danforth as you to gather?
00000241

Picks & Shovels
00000242

Flowers
00000243

Rocks
00000244

Sand
00000245

What trees does Lady Oriel tell you are just folklore, and do not exist except in Cyrus Drake's mind?
00000246

Truffula
00000247

Dryads
00000248

Qliphoth
00000249

Bartleby
00000250

What two names are on the Statues in the Marleybone cathedral?
00000251

Saint Bernard and Saint Hubert
00000252

Saint Bernard and Saint Guinefort‎
00000253

Saint Guinefort‎ and Saint Hubert
00000254

Saint Charles and Saint Bernard
00000255

What was the final grade on Marla's report?
00000256

A minus
00000257

A plus
00000258

B minus
00000259

B plus
00000260

What was the name of the powerful Grendel Shaman who sealed the runic doors?
00000261

Thulinn
00000262

Huldur
00000263

Herkir
00000264

Grettir
00000265

What were Bartleby's eyes called?
00000266

The Eyes of Time
00000267

The Eyes of Ravenwood
00000268

The Eyes of Bartleby
00000269

The Eyes of Seeing
00000270

Where are Hyottoko and his henchmen holed up?
00000271

Mooyoto Pagoda
00000272

Midnight Sun Pagoda
00000273

Shiritake Temple
00000274

River Temple
00000275

Where are the Goji Berries located?
00000276

Unicorn Way Park
00000277

Hametsu Village
00000278

On Blossom's branches
00000279

Hrundle Fjord
00000280

Where does Bolthorn the old Grendel wizard live?
00000281

Boiling Fields
00000282

Northguard
00000283

Wolf Fortress
00000284

Vestri's Hall
00000285

Where is Elik's Edge? 
00000286

Ravenwood Shopping District 
00000287

Colossus Boulevard
00000288

Olde Town
00000289

Ravenwood
00000290

Where is Hildreth Perch? 
00000291

Colossus Boulevard
00000292

Olde Town
00000293

Ravenwood Shopping District 
00000294

Ravenwood
00000295

Where is Milaka Jewelbender's jewelcrafter's table?
00000296

Chronius' tower.
00000297

Crystal Tower
00000298

Tower of War
00000299

Homunculus' Tower
00000300

Where is the Dragonspyre headmaster's office located?
00000301

Atop the Great Volcano
00000302

Necropolis
00000303

Dragon Roost
00000304

Basilica
00000305

Which faculty member is building a Clockwork?
00000306

Moolinda Wu
00000307

Lydia Greyrose
00000308

Cyrus Drake
00000309

Dworgyn
00000310

Which if these is NOT a Zafaria Anchor Stone?
00000311

Rasik Anchor Stone
00000312

Charlotta Anchor Stone
00000313

Kwaku  Anchor Stone
00000314

Yoth  Anchor Stone
00000315

Which of these is not written on the Death School Chalkboard?
00000316

Today's lessons
00000317

Fallen from above
00000318

Death survives below
00000319

Death = strong
00000320

Which Professor vanished while digging in the Pyramids?
00000321

Professor Livingood
00000322

Professor Winthrop
00000323

Professor Danforth
00000324

Professor Falmea
00000325

Who accused Wadsworth of stealing her shoes?
00000326

Ms Marphely
00000327

Ms. Conrail
00000328

Tracy Castleton
00000329

Sally Newflower
00000330

Who administers the Test of Mind in MooShu?
00000331

Lo Pang
00000332

Lu Song
00000333

Xihong Bi
00000334

Fong Lee
00000335

Who allows you to retrieve a replacement Living Ember from the Fountain in Avalon?
00000336

Ceara Ashbury
00000337

Ashlynn BrushTail
00000338

Brinly Ashbury
00000339

Riodh Firehilt
00000340

Who are the Vanguard of the Titan's army?
00000341

The Draconians
00000342

The Giants
00000343

The Battledrakes
00000344

The Loremaster
00000345

Who asks if you are the Gatekeeper?
00000346

Sokkwi Keymaster
00000347

Grimaldi Keymaker
00000348

The Bonekeeper
00000349

Merle Ambrose
00000350

Who ate the poisonous berries in MooShu?
00000351

Binh Hoa
00000352

Din Ho
00000353

Emperor Yoshihito
00000354

Hakaru Yip
00000355

Who battled her way past the guards of King Betrin to win the Knowledge Crystals that saved her world?
00000356

Iona Pyrelance
00000357

Drusilla Morningbane
00000358

Mavra Flamewing
00000359

Katia Firewinter
00000360

Who can polish the Phylactery Shard?
00000361

Torrence the Storm Tree
00000362

Blossom the Life Tree
00000363

Ivan the Myth Tree
00000364

Mortis the Death Tree
00000365

Who carries the Symbol of Passage to enter the trophy room?
00000366

Sand Stalkers
00000367

Serket Guardians
00000368

Sokkwi Soldiers
00000369

Flame Guardians
00000370

Who caused the Giants to slumber and turn into Glaciers?
00000371

The Great Raven, Lady Nightstar
00000372

The Titans
00000373

The Dragons
00000374

Bartleby
00000375

Who created Fire Magic to battle their sworn enemies, the Giants and the Tritons?
00000376

The Dragons
00000377

Merle Ambrose
00000378

Dalia Falmea
00000379

Bartleby
00000380

Who defeated Challenger Lyon in an open duel in front of the council of wizards, warriors, and king?
00000381

Rurik Flamesoul
00000382

Ivan Ironshell
00000383

Vidor Drakesmith
00000384

Mother Flamestrike
00000385

Who did Lady Oriel's sister visit to 'cheer up'?
00000386

Dworgyn
00000387

Lady Oriel
00000388

Bartleby
00000389

Merle Ambrose
00000390

Who did the Council train to defend the Wizard's knowledge from the warriors?
00000391

Boris Blackrock
00000392

Zarathax
00000393

Mother Flamestrike
00000394

Cyrus Drake
00000395

Who do you defeat to collect the Sleepwalker's Timepiece?
00000396

Wormguts
00000397

Melweena Smite
00000398

Alicane Swiftarrow
00000399

Bastilla Gravewynd
00000400

Who does Abigail Doolittle invite to play his fiddle at the Policemen's Ball?
00000401

David Beeman
00000402

Gordon Sumner
00000403

Officer Wallace
00000404

Houghe Warner
00000405

Who does Ambrose suggest should stop practicing the Death Arts?
00000406

Duncan Grimwater
00000407

Dworgyn
00000408

Malorn AshThorn
00000409

Morganthe
00000410

Who does Castamir Silverdrake want you to give the reins to?
00000411

Kimerith Windhammer
00000412

Katalin Nightseeker
00000413

Sandor Spearcaller
00000414

Valdek Spellflare
00000415

Who drove Angoro out of his tower?
00000416

Kuragaso
00000417

Mossback
00000418

Jikiru
00000419

Nomoonaga
00000420

Who formed the council of wizards, warriors, and king?
00000421

Katia Firewinter
00000422

Zanetta StormBreaker
00000423

Narissa Wyrmscale
00000424

Vesna Shadowscar
00000425

Who gave Bartleby his eyes?
00000426

Grandmother Raven
00000427

Merle Ambrose
00000428

Morganthe
00000429

Gamma
00000430

Who has Keisar Halam's Whetting Stone?
00000431

Tinu Bhak'Mal
00000432

Kaji'rae
00000433

Zan'ne
00000434

Rami
00000435

Who has Matsuo Sato's katana?
00000436

Jikiru
00000437

Kagemoosha
00000438

Stonebreaker
00000439

Usegi
00000440

Who has the last piece of the Jade Scepter?
00000441

Kanago
00000442

Koto
00000443

Kurogaso
00000444

Kyuto
00000445

Who in Olde Town was friends with Sylvia Drake?
00000446

Gloria Krendell
00000447

Eudora Tangletree
00000448

Elmer Meadowgrass
00000449

Sergeant Muldoon
00000450

Who is Bartleby's sister?
00000451

Grandmother Raven
00000452

Morganthe
00000453

Blossom the Life Tree
00000454

Priya
00000455

Who is being kidnapped by the Metal Men?
00000456

Baxter
00000457

Grunk
00000458

Meowiarty
00000459

Dr. Von Katzenstein
00000460

Who is bringing the Crystal Punch Bowl to the Policemen's Ball?
00000461

Amy Brooks
00000462

Ms. Conrail
00000463

Linda Milltop
00000464

Sarah Tanner
00000465

Who is Falmea's normal supplier for Fire Gems?
00000466

Gustav Copperflame
00000467

Bleys Flamerender
00000468

Anna Flamewright
00000469

Zanna Fireflower
00000470

Who is Hakaru Yip's apprentice?
00000471

Binh Hoa
00000472

Kaili Liu
00000473

Su Lee
00000474

Toshio
00000475

Who is making the cages that imprison the fairies?
00000476

Rattlebones
00000477

Lady Oriel
00000478

Ugo Kalahad
00000479

Dorothy Gale
00000480

Who is Nalia Dunestrider feuding with?
00000481

Randolf SpellShine
00000482

Diora SkyFlower
00000483

Micah AngleGrinder
00000484

Flynn SIlverMorn
00000485

Who is poisoning the Mander's food?
00000486

Alchemist Kepi
00000487

Krokhotep
00000488

Krokopatra
00000489

Kiwu
00000490

Who is Professor Winthrop's assistant?
00000491

Malcolm Danforth
00000492

Jack Thistleberry
00000493

Louis Ritchie
00000494

Sed Talam
00000495

Who is the Chief of Security for the Celestian Expedition?
00000496

Edward Kitching
00000497

Barclay O'Brian
00000498

Dalton Prescott
00000499

Rupert Fleming
00000500

Who is the Chief Vault Clerk in Dragonspyre?
00000501

Belia Windgazer
00000502

Balthazar Dragonthorn
00000503

Laszlo Starblade
00000504

Roanna Sorrowscale
00000505

Who is the Dragonspyre Dean's assistant?
00000506

Irenka Thundercrown
00000507

Emil Flamewright
00000508

Narissa Wyrmscale
00000509

Zanna Fireflower
00000510

Who is the Dragonspyre Historian Laureate?
00000511

Halina Warhawk
00000512

Narissa Wyrmscale
00000513

Zafer Flamewielder
00000514

Vesna Shadowscar
00000515

Who is the Dragonspyre Master of Strategy?
00000516

Sandor Spearcaller
00000517

Todor Warchanter
00000518

Tomar Skyblade
00000519

Marek Thistlethorn
00000520

Who is the King of Grizzleheim?
00000521

Valgard Goldenblade
00000522

Erik Wyrdrune
00000523

Olaf Ironchains
00000524

Aevar the Swift
00000525

Who is the only mander to fight in the Grand Arena?
00000526

Oka
00000527

Ako
00000528

Zan'ne
00000529

Rami
00000530

Who is the Princess of the Seraphs?
00000531

Lady Oriel
00000532

Lady Blackhope
00000533

Lady Elizabeth
00000534

Lady of the Lake
00000535

What is the name of the Ice Tree in Ravenwood?
00000536

Kelvin
00000537

Ivan
00000538

Torrence
00000539

Celsius
00000540

What is the name of the bridge in front of the Cave to Nightside?
00000541

Rainbow Bridge
00000542

Spooky Bridge
00000543

Bridge of Secrets
00000544

Duskdale Bride
00000545

What did Prospector Zeke lose in Marleybone?
00000546

The Stray Cats
00000547

The Smiths
00000548

The Beetles
00000549

The Yardbirds
00000550

Which is the only school left standing in Dragonspyre?
00000551

Fire
00000552

Chaos
00000553

Balance
00000554

Death
00000555

Who is the Registrar of Pigswick Academy?
00000556

Mrs. Dowager
00000557

Benedict Glendemming
00000558

Heironimus Bunch
00000559

Belladonna Crisp
00000560

Grizzleheim's greatest stories are recounted on what?
00000561

Rune Stones
00000562

Iron Tableaus
00000563

Golden Tapestries
00000564

Star Charts
00000565

Which Aztecan ponders the Great Questions of Life?
00000566

Philosoraptor
00000567

Transcendentaladon
00000568

Quandarycoatl
00000569

Tyrannosaurus Vex
00000570

Who Is NOT a member of the Council of Light?
00000571

Cyrus Drake
00000572

Lydia Greyrose
00000573

Zenzen Seven Star
00000574

Emperor Yoshihito
00000575

Who is the King of the Burrowers?
00000576

Pyat MourningSword
00000577

Dyvim WhiteHart
00000578

Tobias SplitSky
00000579

Elizar FireBlade
00000580

Who helps Morganthe find the Horn of Huracan?
00000581

Belloq
00000582

Axaya Knifemoon
00000583

Pascal Redmask
00000584

Pachakutiq Who Shakes The Earth
00000585

Who grants the first Shadow Magic spell?
00000586

Sophia DarkSide
00000587

Alana DarkSun
00000588

Amelia StarDust
00000589

Erekose Who-Remembers
00000590

King Artorius is a:
00000591

Bear
00000592

Dog
00000593

Wolf
00000594

Lion
00000595

Baobab Crossroads is the hub for:
00000596

Zafaria
00000597

Celestia
00000598

Avernus
00000599

Azteca
00000600

Merle Ambrose is originally from which world?
00000601

Avalon
00000602

Wizard City
00000603

Marleybone
00000604

Polaris
00000605

Zafaria is home to what cultures?
00000606

Gorillas, Zebras, Lions
00000607

Lions, Tigers, Bears
00000608

Quetzals, Jaguars, Toucans
00000609

Penguins, Polar Bears, Seals
00000610

Shaka Zebu is known best as:
00000611

The Greatest Living Zebra Warrior
00000612

Morganthe's Master of Disguise
00000613

A Striped Lion
00000614

The Queen of Funk
00000615

In Grizzleheim, the Ravens want to bring about:
00000616

The Everwinter, to cover the world in ice.
00000617

The Fiery Sons of Muspell, to cover the world in flames.
00000618

The Jormungandr, to cover the world in storms.
00000619

The Great Night, to cover the world in impenetrable darkness.
00000620

The Swordsman Destreza was killed by:
00000621

A Gorgon
00000622

The Minotaur
00000623

Hades the Unseen
00000624

Cerberus
00000625

Sir Edward Halley is the Spiral's most famous:
00000626

Aztecosaurologist
00000627

Archaeologist
00000628

Quetzalonomer
00000629

Astronomer
00000630

In Azteca, Morganthe enlisted the help of the:
00000631

The Black Sun Necromancers
00000632

The Cruel Star Skeletons
00000633

The Serpents of Xibalba
00000634

The Thunder Horn Zombies
00000635

Morganthe got the Horned Crown from the Spriggan:
00000636

Gisela
00000637

Lisela
00000638

Grienne
00000639

Brienne
00000640

Who is the Stone Keeper?
00000641

Laszlo Starblade
00000642

Darkstone
00000643

Zoltan Nightstone
00000644

Milaka Jewelbender
00000645

Who is the Wizard City mill foreman?
00000646

Sohomer Sunblade
00000647

Blad Raveneye
00000648

Duncan Grimwater
00000649

Kestrel Blackstorm
00000650

Who is writing a report on Grubb of Sunken City?
00000651

Marla Stinger
00000652

Penny Dreadful
00000653

Malorn AshThorn
00000654

Norton
00000655

Who left their Inventory List in one of the camps near the Dig Site?
00000656

Dr. Gordon Flemming
00000657

Harsan Bar'khour
00000658

Sir Reginald Baxby
00000659

Tinu Bhak'mal
00000660

Who made the Portal Gates and Portal Stones?
00000661

Aurek Blazeburner
00000662

Andrei Fireweaver
00000663

Anilla Firemantle
00000664

Todor Warchanter
00000665

Who makes the harpsichord for Shelus?
00000666

Gretta Darkkettle
00000667

Dworgyn
00000668

Eudora Tangletree
00000669

You do!
00000670

Who needs a Clockwork key to better understand how they work?
00000671

Ernest Haldings
00000672

Emily Chesterfield
00000673

Edwin Vintry
00000674

Edward Halley
00000675

Who needs the healing potion from Master Yip?
00000676

Binh Hoa
00000677

Emperor Yoshihito
00000678

Master Yan Kan Kook
00000679

Xun Zhao
00000680

Who needs the Omnibus of Balance?
00000681

Alhazred
00000682

Arthur Wethersfield
00000683

Krokopatra
00000684

Niles the Balance Tree
00000685

Who needs the Solar Lens back from Shelus?
00000686

Anna Flamewright
00000687

Penny Dreadful
00000688

Dalia Falmea
00000689

Mindy PixieCrown
00000690

Who once fed ambrosia to Sunbrand?
00000691

Ivan Soulsinger
00000692

Dalia Falmea
00000693

Anilla Firemantle
00000694

Tomar Skyblade
00000695

Who promised to drive out the Trolls from Cyclops Lane, but went back on his word?
00000696

General Akilles
00000697

Private Sweeney
00000698

Eyus Maximus
00000699

Nolan Stormgate
00000700

Who resides in the Hedge Maze?
00000701

Lady Oriel
00000702

Olivia Dawnwillow
00000703

Roland Silverheart
00000704

Dorothy Gale
00000705

Who rules from the Temple of Storms?
00000706

Krokopatra
00000707

The Bonekeeper
00000708

Guardian of the Fang
00000709

Queen Irisi Djeserit
00000710

Who runs the Boot and Ring shop in the MooShu marketplace?
00000711

Kamooya Kaoru
00000712

Fida Hadochan
00000713

Sagara Samoosuke
00000714

Himoora Kenshin
00000715

Who sang the Dragons, Titans and Giants into existence?
00000716

Bartleby
00000717

Gamma
00000718

Merle
00000719

Malistaire
00000720

Who sang your Wizard's name to Dworgyn?
00000721

A little black bat
00000722

A little black cat
00000723

A little birdie
00000724

A siren
00000725

Who says: With crystal eyes I do perceive, a Wizard seeks my life to leave. 
00000726

Crystalline Queen
00000727

Ancient Crystalweaver
00000728

Crystal Crawler
00000729

Milaka Jewelbender
00000730

Who sells recipes for crafted Balance robes in Dragonspyre?
00000731

Balthazar Dragonthorn
00000732

Khalkos Coppersmith
00000733

Todor Warchanter
00000734

Terrence Heath
00000735

Who sells the spell Reshuffle? 
00000736

Mildred Farseer 
00000737

Niles the Balance Tree
00000738

Alhazred
00000739

Arthur Wethersfield
00000740

Who sends you on your way by saying 'Toodles!'?
00000741

Professor Arthur Wethersfield
00000742

Professor Lydia Greyrose
00000743

Professor Halston Balestrom
00000744

Gamma
00000745

Who spills the beans that the knock is... Knock-tap-tap-knock-tap-knock-knock-knock...
00000746

Brady the Sneak
00000747

Kenedy the Klaw
00000748

Spike the Crusher
00000749

Mikey the Brick
00000750

Who still watches over the Hatchery, even after all this time?
00000751

Mother Drake
00000752

Grandmother Raven
00000753

Merle Ambrose
00000754

Sylvia Drake
00000755

Who stole the Eye of History?
00000756

Malistaire
00000757

Morganthe
00000758

Gamma
00000759

Merle Ambrose
00000760

Who summoned an army to run out the ghosts in Colossus Boulevard?
00000761

Professor Greyrose
00000762

Baron Greebly
00000763

Baron Rotunda
00000764

Prince Gobblestone
00000765

Who taught Life Magic before Moolinda Wu?
00000766

Sylvia Drake
00000767

No one
00000768

Lady Oriel
00000769

Lady Sylvan
00000770

Who taunts you with: "I've got the brains and the brawn, you stand no chance!"
00000771

Dr VonKatzenstein
00000772

Clanker
00000773

Meowiarty
00000774

Kenedy the Klaw
00000775

Who taunts you with: "Prepare to be broken, kid!"
00000776

Clanker
00000777

Kenedy the Klaw
00000778

Pops O'Leary
00000779

Freddy Nine Lives
00000780

Who taunts you with: Wizard, you will know the meaning of the word pain after we battle!
00000781

Aiuchi
00000782

Shoji
00000783

Jikiru
00000784

Fushiko
00000785

Who taunts: Why I oughta knock you to the moon, you pesky little creep!
00000786

Mugsy
00000787

Freddy Nine Lives
00000788

Pops O'Leary
00000789

Kenedy the Klaw
00000790

Who tells you "A shield is just as much a weapon as the sword".
00000791

Mavra Flamewing
00000792

Diego the Duelmaster
00000793

Roland Silverheart
00000794

Professor Greyrose
00000795

Who tells you the Lumina Crystals are drained of magic?
00000796

Blad Raveneye
00000797

Halston Balestrom
00000798

Sohomer Sunblade
00000799

The Elder Seer
00000800

Who tells you to speak these words only unto your mentor: "Meena Korio Jajuka!"
00000801

Priya the Dryad
00000802

Dworgyn
00000803

The Elder Seer
00000804

Bartleby
00000805

Who thinks it is unfortunate that you haven't been eaten by any of your summons?
00000806

Professor Drake
00000807

Alhazred
00000808

Merle Ambrose
00000809

Halston Balestrom
00000810

Who thinks we are there to take their precious feathers?
00000811

Takeda Kanryu
00000812

Spellwrit Winged Tooth
00000813

Copper Wing Guard
00000814

Winged Tooth Knight
00000815

Who used to teach Alchemy at Ravenwood School of Magical Arts?
00000816

Gretta Darkkettle
00000817

Dworgyn
00000818

Malistaire
00000819

Alicane SwiftArrow
00000820

Who wants to turn you into a stew?
00000821

Baron Greebly
00000822

Baron Rotunda
00000823

Prince Gobblestone
00000824

Pira'Nya Scissor Teeth
00000825

Who was supposed to find a Bloodstone Ring for a young lady in Celestia?
00000826

Shelus Gruffheart
00000827

Oya Bloodstorm
00000828

Morag Bloodtine
00000829

Private Quinn
00000830

Who was the Ahnic queen before Krokopatra?
00000831

Irisi
00000832

Calypso
00000833

Ellen
00000834

Aryanah
00000835

Who works directly under Pops?
00000836

Brady the Sneak
00000837

Clanker
00000838

Kenedy the Klaw
00000839

Freddy Nine Lives
00000840

Who's name is etched on the back of the charm bracelet?
00000841

Ivan Soulsinger
00000842

Iona Pyrelance
00000843

Sylvia Drake
00000844

Mother Moon
00000845

Who's tower did Rattlebones take over?
00000846

Delia
00000847

Lady Blackhope
00000848

Lady Oriel
00000849

No one, it's his tower
00000850

What does Billy Brute ask you to fetch him a pot of?
00000851

Mutton
00000852

Gold
00000853

Blood
00000854

Soup
00000855

What can set Billy Brute free?
00000856

A Cloak of Raven Shadows
00000857

A Bowl of Mutton
00000858

Twisted Treant Branches
00000859

Sulfur
00000860

Who is the rightful owner of the Divining Treasure?
00000861

Three Color Serpent
00000862

Sir Malory
00000863

Pendragon
00000864

Heidi IronNails
00000865

What are young Wizards ask to collect from the Rainbow Fountain to free the Imp Village?
00000866

Arcane Water
00000867

Sulfur
00000868

Gold
00000869

Dragon Blood
00000870

What is the Pendragon's full name?
00000871

Lord of the Wild Hunt
00000872

Lord of the Horned Ones
00000873

Lord of the Pendragons
00000874

Bob
00000875

Where did the Pendragon's Horned Ones secure the Sword of Kings?
00000876

A Froudling Wagon
00000877

A secret location
00000878

The Chromatic Tower
00000879

At Shane MacGobhann's house
00000880

What did Froudlings steal from Brigid's Tomb?
00000881

Carved Markers & Weapons
00000882

Treasures
00000883

Gold
00000884

Nothing
00000885

What is the name of the Tapestry inside the Tomb of the Nameless?
00000886

All the Colors of Descent
00000887

All the Colors of Ascent
00000888

All the Colors of the Spectrum
00000889

Nothing, it was scratched out
00000890

What creature is stuck in the bog and can't get out?
00000891

White Hart
00000892

Froudling
00000893

Spriggan
00000894

Three Color Serpent
00000895

Who saved Sophia GreenSleeve's mother from a giant's axe?
00000896

Sir Malory
00000897

King Artorious
00000898

Lady of the Lake
00000899

Sir Gerard Monmouth
00000900

Where is the home of the unspeakable Indigo Giant?
00000901

Dun Scaith
00000902

Dread Keep
00000903

Crystal Tower
00000904

Tower of War
00000905

What is King Amadeo's favorite food?
00000906

Tea & Crumpets
00000907

Pickles
00000908

Lobster Thermidor
00000909

Figs
00000910

Where can you find The Stolen Pickle?
00000911

Marleybone
00000912

Mooshu
00000913

Krokotopia
00000914

Grizzleheim
00000915

What badge do you earn by defeating 100 Samoorai?
00000916

Yojimbo
00000917

Ronin Hunter
00000918

Samoorai
00000919

Ninja Hunter
00000920

Where can you obtain a Large Gardening Pot?
00000921

You can't
00000922

Moolinda Wu
00000923

You craft it
00000924

Farley the Gardener
00000925

What is the symbol on the entrance of Dragon's Mouth Cave in Golem Court?
00000926

Nothing
00000927

A dragon
00000928

Fire
00000929

Skull
00000930

Where has Pharenor been imprisoned?
00000931

Skythorn Tower
00000932

Thorn Sky Tower
00000933

Tower of Fire
00000934

Crystal Tower
00000935

What is your title at level 50?
00000936

Grandmaster
00000937

Novice
00000938

Transcendent
00000939

Ethereal
00000940

What date did Wizard101 launch?
00000941

September 2, 2008
00000942

December 2, 2008
00000943

September 2, 2009
00000944

December 2, 2007
00000945

Who is Malistaire's brother?
00000946

Cyrus Drake
00000947

Halston Balestrom
00000948

Malorn Ashthorn
00000949

Dworgyn
00000950

How much does the pixie spell heal for?
00000951

400
00000952

100
00000953

200
00000954

300
00000955

In which world do pigs attend classes?
00000956

Wysteria
00000957

Marleybone
00000958

Mooshu
00000959

Grizzleheim
00000960

What made Malistaire turn evil?
00000961

His wife got sick.
00000962

He got sick.
00000963

He was born evil, and hid it well.
00000964

He was introduced to the Plague Oni.
00000965

Which of these places are not in Marleybone?
00000966

Krokosphinx
00000967

Counterweight East
00000968

Counterweight West
00000969

Big Ben
00000970

Who is the main villain in Sunken City?
00000971

Grubb
00000972

The Vampire King
00000973

Meowiarty
00000974

Gretta Darkettle
00000975

Which school is known for healing?
00000976

Life
00000977

Ice
00000978

Death
00000979

Myth
00000980

What colors represent the myth school?
00000981

Blue and Gold
00000982

Blue and Orange
00000983

Blue and Red
00000984

Blue and Green
00000985

What school is all about passion?
00000986

Fire
00000987

Ice
00000988

Balance
00000989

Death
00000990

Who was the Death School Professor before Dworgyn?
00000991

Malistaire
00000992

Halston Balestrom
00000993

Morganthe
00000994

Meowiarty
00000995

What color is the myth tree's eye?
00000996

Brown
00000997

Yellow
00000998

Blue
00000999

Green
00001000

Who is the Nameless Knight?
00001001

Sir Malory
00001002

Balthazar Dragonthorn
00001003

Gwendolyn
00001004

Halston Balestrom
00001005

Who sells Valentine's Day items in Wizard City?
00001006

Valentina Heartsong
00001007

Valentine Pig
00001008

Felix Navidad
00001009

Eloise Merryweather
00001010

Who prophesizes this? "The mirror will break, The horn will call, From the shadows I strike , And the skies will fall..."
00001011

Morganthe
00001012

Grandmother Raven
00001013

Malistaire Drake
00001014

Sylvia Drake
00001015

Why are the Gobblers so afraid to go home?
00001016

Witches
00001017

Darkness
00001018

Hunger
00001019

Snakes
00001020

Why are the pixies and faeries on Unicorn Way evil?
00001021

Rattlebones corrupted them.
00001022

They were born evil.
00001023

Lady Oriel corrupted them.
00001024

They ate poisoned pie.
00001025

What is the shape of the pink piece in potion motion?
00001026

Heart
00001027

Star
00001028

Diamond
00001029

Horseshoe
00001030

What's the name of the balance tree?
00001031

Niles
00001032

Miles
00001033

Scales
00001034

Justice
00001035

Which below are NOT a type of Oni in MooShu?
00001036

Ruby
00001037

Jade
00001038

Death 
00001039

Plague
00001040

How many worlds of The Spiral are unlocked as of May 21st, 2014?
00001041

12
00001042

11
00001043

13
00001044

15
00001045

What did Prospector Zeke lose track of in MooShu?
00001046

Blue Oysters
00001047

Beetles
00001048

Smiths
00001049

Lounge Lizards
00001050

Which one of these are not a symbol on the battle sigil?
00001051

Wand
00001052

Sun
00001053

Star
00001054

Key
00001055

Which of these locations is not in Wizard City?
00001056

Digmoore Station
00001057

Nightside
00001058

Sunken City
00001059

Gobbler King's Castle
00001060

Who guards the entrance to Unicorn Way?
00001061

Private Stillson
00001062

Private Stinson
00001063

Private Connelly
00001064

Private Donnelly
00001065

Who is in the top level of the Tower of the Helephant?
00001066

Lyon Lorestriker
00001067

Kogasha
00001068

Sylster Glowstorm
00001069

Jade Oni
00001070

An unmodified Sun Serpent does what?
00001071

900 - 1000 Fire Damage + 300 Fire Damage to entire team
00001072

300 + 800 Fire Damage over 3 Rounds to entire team
00001073

440 + 351 Fire Damage over 3 Rounds to entire team
00001074

840 Fire Damage, +10% Fire Armor Piercing + Stun Target
00001075

What type of rank 8 spell is granted to Death students at level 58?
00001076

Damage + DoT
00001077

AoE
00001078

Damage + Stun
00001079

AoE DoT
00001080

Who is the Bear King of Grizzleheim?
00001081

Valgard Goldenblade
00001082

Bjorn Ironclaws
00001083

Baldur Goldpaws
00001084

Erik Wyrdrune
00001085

What is unique about Falmea's Classroom?
00001086

There are scorch marks on the celling
00001087

It's the only classroom without books
00001088

It is dark
00001089

It doesn't have chalkboards
00001090

What is the name of the new dance added with Khrysalis?
00001091

The bee dance
00001092

The cat dance
00001093

The spider dance
00001094

The mantis dance
00001095

What is the name of the book stolen from the Royal Museum?
00001096

The Krokonomicon
00001097

The Compendium of Knowledge
00001098

The Dictionary of All Magic
00001099

Dr. Von's Lab Notes
00001100

What school is the Gurtok Demon focused on?
00001101

Death
00001102

Fire
00001103

Ice
00001104

Life
00001105

What hand does Lady Oriel hold her wand in?
00001106

Trick question, she has a sword
00001107

Both hands
00001108

Left
00001109

Right
00001110

What is the name of the secret society in Krokotopia
00001111

Order of the Fang
00001112

Order of the Key
00001113

Order of the Krok
00001114

Order of the Scales
00001115

What is Professor Falmea's favorite food?
00001116

Pasta Arribata
00001117

Ice Cream
00001118

Hot wings
00001119

Chili
00001120

Which of these are not a lore spell?
00001121

Fire Dragon
00001122

Goat Monk
00001123

Handsome Fomori
00001124

Catalan
00001125

What school is the spell Dark Nova?
00001126

Shadow
00001127

Balance
00001128

Death
00001129

Sun
00001130

How long do you have to wait to join a new match after fleeing in PVP?
00001131

5 minutes
00001132

10 minutes
00001133

15 minutes
00001134

There is no cool down timer, you can re-join instantly.
